# ODBC

Stands for __O__pen __D__atabase __C__onnectivity. It provides an __A__pplication __P__rogramming __I__nterface (API) that allows client side programs to call DBMS.<br>
* Query and transaction requests are sent using the ODBC API to the RDBMS.
* Query results are sent back to client programs.
* Example: JDBC for Java programs, pyodbc for Python.<br>
<img src="arch.jpg" alt="Three tier client server architecture for DBMS" title="Three tier architecture" width="400" hight="400" align="left"/>

Some guidelines for writing Jupyter notebooks can be found here <br>
https://www.ibm.com/support/knowledgecenter/SSHGWL_1.2.3/analyze-data/markd-jupyter.html

# Jupyter notebook

To work with jupyter notebook: <br>
* Install Anaconda https://www.anaconda.com/
* Install pyodbc as illustrated here https://pypi.org/project/pyodbc/ by typing pip install pyodbc in anaconda prompt (you will find anaconda prompt in the start menu)
* Launch jupyter notebook from anaconda prompt by typing: jupyter notebook

# Imports

In [25]:
import pyodbc as podbc
import pandas as pd
# More about Pandas https://pandas.pydata.org/about/index.html

# Connect to DB method

In [72]:
def connect_to_db():
    conn = podbc.connect('Driver={SQL Server};'
                          'Server=RAISA-CAIRO-19\SQLEXPRESS;'
                          'Database={COMPANY};'
                          'Trusted_Connection=yes;')
    cursor = conn.cursor()
    return conn, cursor

# Execute query method

In [73]:
def execute_query(query, cursor):
    cursor.execute(query)
    for row in cursor:
        print(row)
    df = pd.read_sql_query(query, conn)
    cursor.commit()
    return df

In [74]:
def execute_non_return_query(query, cursor):
    cursor.execute(query)
    cursor.commit()

# Create table query

In [75]:
query = """CREATE TABLE EMPLOYEE(
Fname VARCHAR(15) NOT NULL,
Minit CHAR,
Lname VARCHAR(15) NOT NULL,
Ssn char(9) NOT NULL,
Bdate DATE,
Address VARCHAR(30),
gender CHAR,
Salary DECIMAL(10,2),
Super_ssn CHAR(9),
Dno int NOT NULL,
PRIMARY KEY(Ssn)
)"""

In [85]:
print(query)

SELECT * FROM EMPLOYEE

In [78]:
conn, cursor = connect_to_db()

In [ ]:
execute_non_return_query(query, cursor)

# Insert

In [80]:
query = """INSERT INTO EMPLOYEE VALUES('John', 'B', 'Smith', '123456789', '1965-01-09', 
'371 Fondren, Housten, TX', 'M', 30000, '333445555', 5)
"""

In [81]:
execute_non_return_query(query, cursor)

# Select

In [83]:
query = "SELECT * FROM EMPLOYEE"

In [84]:
execute_query(query, cursor)

('John', 'B', 'Smith', '123456789', '1965-01-09', '371 Fondren, Housten, TX', 'M', Decimal('30000.00'), '333445555', 5)

,Fname,Minit,Lname,Ssn,Bdate,Address,gender,Salary,Super_ssn,Dno
0,John,B,Smith,123456789,1965-01-09,"371 Fondren, Housten, TX",M,30000.0,333445555,5